
{
	"code":"Do you know? Almost anything powered by electricity requires code. And Ada Lovelace was the world’s first computer programmer, who worte the first code all the way back in the mid-1800s",
	"return":"In c++, 'return' is a keyword which marks the end of flow within a function block. When compiler encounters 'return', it generates the code to return from current function and clearing up of current function 's stack frame",
	"main":"This function is the entry point of any C++ program. It is the point at which execution of program is started. When a C++ program is executed, the execution control goes directly to the main() function.",
	"function":"A function is a block of code which only runs when it is called. You can pass data, known as parameters. If function uses default arguments then default arguments can’t be written in both function declaration & definition.",
	"#include":"#include is a way of including a standard or user-defined file in the program. The process of importing such files that might be system-defined or user-defined is known as File Inclusion.",
	"cout":"The 'c' in cout refers to 'character' and 'out' means 'output'. The cout object in C++ is an object of class ostream. After proper implementation of cout it is tied with cin, which is basically cout.flush() ",
	"character":"The char data type is an integral type, meaning the underlying value is stored as an integer, and it’s guaranteed to be 1-byte in size.",
	"int":"Int, short for 'integer' is a fundamental variable type built into the compiler and used to define numeric variables holding whole numbers.",
	"errors":"Errors in your code means you are trying to do something cool!! Encountering bugs is one of the best ways to improve code by showing weaknesses.Hence, guide you towards building more reliable and secure products",
	"comment":"Comment is a programmer-readable explanation in the source code of a computer program. They are added with the purpose of making the source code easier for humans to understand, and are generally ignored by compilers and interpreters",
	"preprocessor":"All preprocessor directives begin with #, and only white-space characters may appear before a preprocessor directive on a line and since they are not c++ statement so they donot end with ';' ",
	"directives":"Directive or pragma is a language construct that specifies how a compiler should process its input. Its not part of grammar of programming language",
	"std":"std a namespace. The '::' operator is the 'scope' operator. It tells the compiler which class/namespace to look in for an identifier.",
	"namespace":"A namespace is a declarative region that provides a scope to the identifiers (the names of types, functions, variables, etc) inside it. Namespaces are used to organize code into logical groups and to prevent name collisions",
	"language":"Did you know how many total programming languages? – it’s 698. And the first high-level (very close to real English that we use to communicate) programming language was FORTRAN. invented in 1954 by IBM’s John Backus.",
	"iostream":"Header that defines the standard input/output stream objects.",
	"compiler":"Compiler is used to convert c++ high-level language code to assembly language, which will be furthur converted to machine code.",
	"identifiers":"A C++ identifier is a name used to identify a variable, function, class, module, or any other user-defined item",
	"variable":"Variable is a name which is associated with a value that can be changed. For example when I write int num=20; here variable name is num which is associated with value 20",
	"memory":"Memory holds the data and instructions that the Central Processing Unit (CPU) needs. Before a program can be run, the program is loaded from some storage medium into the memory.",
	"bytes":"Byte is a unit of data that is eight binary digits long. A byte is the unit most computers use to represent a character such as a letter, number or typographic symbol",
	"long":"Type long (or long int) is an integral type that is larger than or equal to the size of type int. (On Windows long is the same size as int.)",
	"float":"Type float is the smallest floating point type.It is of size 4 bytes",
	"double":"Type double is a floating point type that is larger than or equal to type float, but shorter than or equal to the size of type long double.",
	"unsigned":"The unsigned keyword is a data type specifier, that makes a variable only represent natural numbers. It can be applied only to the char, short ,int and long types.",
	"programming":"The first programmer was a girl named ADA Lovelace.She described an algorithm for the Analytical Engine to compute Bernoulli numbers. Since the algorithm was considered to be the first specifically written for implementation on a computer, she has been cited as the first computer programmer."
}